const characters = {
    faust: {
      src: 'faustfull',
      name: 'Фауст',
      surname: 'Холден',
      age: 35,
      height: 188,
      bd: '26 апреля',
      lore: `
            <p>• Фауст родился в обычной семье в небольшой деревушке под названием "Парджа". Она располагалась достаточно далеко от столицы, даже от ближайшего города, и отличалась холодными погодными условиями. Мать Фауста — Элиана, очень добрая женщина, которая работала пекарем и снабжала многих жителей деревни свежими булочками. О своем отце Фауст не знал абсолютно ничего, по словам странствующих торговцев, он был <span className="blur">одним из солдат "Храма Пламени"</span>, однако сейчас <span className="blur">считается пропавшим без вести</span>. Мать, в свою очередь, тоже ничего не говорит о нем, <span className="blur">будто бы находится под прицелом</span>.</p>
            
            <p>• Детство Фауста прошло, как и у обычного ребенка, за тем исключением, что он не владел магией. На то время, это было достаточно странным явлением, и он был единственным жителем деревни, не владеющим магией. Однако от этого факта, его детство никак не поменялось, он много хулиганил, порой далеко уходил из деревни в неизвестном направлении, подрабатывал и приносил деньги маме. Семья жила достаточно бедно, и работа матери едва позволяла прокормить их обоих.</p>
            
            <p>• Кроме того, мать Фауста страдала от редкого заболевания "Некроз", от которого на данный момент нет лечения. Это заболевание представляет собой медленное гниение человека, охватывающее все тело и душу, и покрывающее тело мрачным темным цветом. Люди с таким заболеванием обычно не живут долго, и как бы Фауст и его мама ни старались накопить деньги на попытку пройти реабилитацию, им не удавалось даже близко приблизиться к нужной сумме. В возрасте 34 лет Элиана погибла, не сумев побороть свое заболевание.</p>
            
            <p>• Фауст достаточно болезненно пережил смерть матери, она всегда настраивала его на лучшее, но он понимал, что все идет к худшему. На момент смерти ему было 14 лет, и в столь раннем возрасте он уже работал лесорубом и имел хорошие физические показатели.</p>
            
            <p>• Через год после смерти Элианы в деревню пришли "Белые Ястребы". Они искали молодых бойцов в свои ряды, и среди местных жителей Фауст оказался самым подходящим вариантом: с раннего возраста он занимался тяжелой работой и имел отличные физические данные. Ему щедро заплатили и предоставили приемную семью. Хотя Фауст и не воспринимал своих приемных родителей как семью, у него не было выбора: ему было просто нечего противопоставить столь могущественной организации.</p>
            
            <p>• Фауст переехал в большой город "Альтерон" и в 16 лет был направлен в академию "Белых Ястребов". Его результаты шокировали инструкторов: несмотря на то что Фауст не владел магией, его физические способности позволяли ему обгонять учеников с магией и быстро справляться с заданиями. В 18 лет он окончил академию и сразу стал Рыцарем, перепрыгнув начальные ранги.</p>
            
            <p>• В возрасте 23 лет Фауст уже достиг максимального звания в иерархии рыцарей. В результате одной из битв с очередным революционером он получил необычный артефакт в добычу. После возвращения в штаб и отчета к нему попросил подойти <span className="blur">"..."</span>. <span className="blur">"У меня для тебя интересное предложение,"</span> — сказал он с небольшой ухмылкой.</p>
            
            <p>• Верховный Командер <span className="blur">очень сомнительно отнесся к этому, ведь знал, чем это заканчивается, однако отговорить Фауста он</span> не смог. <span className="blur">На удивление,</span> эксперимент <span className="blur">прошел</span> успешно.</p>
            
            <p>• После окончания службы Фауст переехал в деревню, вложил свои сбережения в ее развитие и получил уважение местных жителей.</p>
            
            <p><span className={styles.modalOverlay__citata}>"— Жизнь — это не только битвы и победы. Это и маленькие радости, которые мы создаем для себя и других. Помните, что даже в самых темных временах можно найти свет, если оставаться верным своим принципам и не бояться протянуть руку помощи."</span></p>
      `,
    },
    lonarius: {
      src: 'lonariusfull',
      name: 'Лонариус',
      age: 16,
      height: 180,
      bd: '6 мая',
      lore: '...................................................................',
    },
    vivian: {
      src: 'vivianfull',
      name: 'Вивиан',
      surname: 'Фростмур',
      age: 16,
      height: 163,
      bd: '7 октября',
      lore: '...................................................................',
    },
  };
  
  export default characters;